app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $user = User::find($request->id);

        if($user->password != null)
        {
        throw ValidationException::withMessages(['id' => 'This user is already registered , please log in !']);
        }

        else{
            $request->validate([
                'id' => ['required', 'exists:users,id'],
                'password' => ['required', 'confirmed'],
            ]);
            $user->update(['password'=>Hash::make($request->password)]);
---
SELECT * FROM `users` WHERE `users`.`id` = '761' LIMIT 1
UPDATE `users` SET `password` = '$2y$10$vpgcANDSq.yCn98mz6nlde7Bz8YpQaJyXQk39ZlqrGmUuyEvHkVBO', `users`.`updated_at` = '2023-10-14 17:08:48' WHERE `id` = 761