app/Http/Controllers/TaskController.php

    public function index(Request $request)
    {

        $tasks = (Auth::user()->role == 'admin') ? Task::where('execution_dep','aqelect')->orderby('due_date')
        :Task::where('assignment', Auth::user()->name)->orderby('due_date');
---
SELECT * FROM `tasks` WHERE `assignment` = 'Mahmoud Fawzy' ORDER BY `due_date` ASC

    public function assign(Task $task){
        $today=date('Y-m-d');
        $attendees = Schedule::with('user')->where(['date'=>$today,'site'=>$task->site])->get();
---
SELECT * FROM `schedules` WHERE (`date` = '2023-10-14' and `site` = 'NAQP3')
SELECT * FROM `users` WHERE `users`.`id` in (761)

    public function assign_task(Task $task , Request $request){
        $task->update(['assignment'=>$request->employee]);
---
UPDATE `tasks` SET `assignment` = 'Islam Abd Rabo', `tasks`.`updated_at` = '2023-10-14 17:04:17' WHERE `id` = 589

    public function add_task(){
        return view('add_task' ,['departments'=>Department::all()]);
---
SELECT * FROM `departments`

    public function get_task_data(Request $request){
        $data = Equipment::where('site',"$request->location")->where('tag','LIKE',"%{$request->term}%")->pluck('tag');
---
SELECT `tag` FROM `equipment` WHERE `site` = 'MED' and `tag` LIKE '%m-p-%'

    public function get_equip_desc(Request $request){
        $description = Equipment::where('tag',$request->tag)->first()->description;
---
SELECT * FROM `equipment` WHERE `tag` = 'M-P-10A' LIMIT 1