app/Http/Controllers/TaskController.php

SELECT `tag` FROM `equipment` WHERE `site` = 'MED' and `tag` LIKE '%z%'
---
    public function get_task_data(Request $request){
        $data = Equipment::where('site',"$request->location")->where('tag','LIKE',"%{$request->term}%")->pluck('tag');

SELECT * FROM `equipment` WHERE `tag` = 'g' LIMIT 1
---
    public function get_equip_desc(Request $request){
        $description = Equipment::where('tag',$request->tag)->first()->description;